'''
1019 책 페이지 - 수학
그냥 규칙 찾기 문제다. 맞히고 나서 구글링 해보니까 일의자리 수가 9가 나올 때까지 빼면
0부터 9까지의 개수가 일치하므로 (처음의 0도 센다고 가정하면)
그 수만큼 더해주고 처음에 가정한 0은 빼주어야 하므로 나중에 이를 계산하는 방식이다.
나는 좀 하수같지만 직관적인 방식으로 풀었다.
10**n-1마다 상태를 저장해 두고 이를 가지고 응용해서 풀었다.
'''
import sys
input=sys.stdin.readline

n=int(input())
d=[[] for i in range(9)]
d[0]=[0,0,0,0,0,0,0,0,0,0]
d[1]=[0, 1, 1, 1, 1, 1, 1, 1, 1, 1]
d[2]=[10, 20, 20, 20, 20, 20, 20, 20, 20, 20]
d[3]=[190, 300, 300, 300, 300, 300, 300, 300, 300, 300]
d[4]=[2890, 4000, 4000, 4000, 4000, 4000, 4000, 4000, 4000, 4000]
d[5]=[38890, 50000, 50000, 50000, 50000, 50000, 50000, 50000, 50000, 50000]
d[6]=[488890, 600000, 600000, 600000, 600000, 600000, 600000, 600000, 600000, 600000]
d[7]=[5888890, 7000000, 7000000, 7000000, 7000000, 7000000, 7000000, 7000000, 7000000, 7000000]
d[8]=[68888890, 80000000, 80000000, 80000000, 80000000, 80000000, 80000000, 80000000, 80000000, 80000000]
#d[9]=[788888898, 900000001, 900000000, 900000000, 900000000, 900000000, 900000000, 900000000, 900000000, 900000000]
ans=[0]*10
x=0
if n==10**9:
    n-=1
    x=1
N=len(str(n))
c=0
for i in range(N-1,-1,-1):
    k=10**i
    a=n//k
    if i==N-1:
        c+=(n-k+1)*(i+1)
    else:
        c+=9*(10**i)*(i+1)
    for j in range(10): #맨 앞자리 빼고 나머지만 계산
        ans[j]+=d[i][j]*a
    for j in range(1,a): #맨 앞자리 계산 
        ans[j]+=k
    ans[a]+=n%k+1
    n-=a*k
if len(str(n))==1:
    for i in range(1,n+1):
        ans[i]+=1
ans[0]=0
ans[0]=c-sum(ans)
if x==1:
    ans[0]+=9
    ans[1]+=1
print(*ans)
